In [2]:
import pandas as pd

In [3]:
data = {'Roll Number': [1,2,3,4,5,6,7,8,9,10],
       'Name': ['AB','BC','CD','DE','EF','FG','GH','HI','IJ','JK'],
       'Gender' : ['M','M','M','F','F','M','M','F','M','F'],
       'Marks1' : [15,22,38,12,41,24,32,50,6,28],
       'Marks2' : [32,44,11,27,36,21,43,39,28,25],
       'Marks3' : [50,29,18,25,37,33,28,24,38,20]}

df = pd.DataFrame(data)

In [4]:
df

   Roll Number Name Gender  Marks1  Marks2  Marks3
0            1   AB      M      15      32      50
1            2   BC      M      22      44      29
2            3   CD      M      38      11      18
3            4   DE      F      12      27      25
4            5   EF      F      41      36      37
5            6   FG      M      24      21      33
6            7   GH      M      32      43      28
7            8   HI      F      50      39      24
8            9   IJ      M       6      28      38
9           10   JK      F      28      25      20

In [5]:
df['Total_Marks'] = df['Marks1'] + df['Marks2'] + df['Marks3']

In [7]:
df

   Roll Number Name Gender  Marks1  Marks2  Marks3  Total_Marks
0            1   AB      M      15      32      50           97
1            2   BC      M      22      44      29           95
2            3   CD      M      38      11      18           67
3            4   DE      F      12      27      25           64
4            5   EF      F      41      36      37          114
5            6   FG      M      24      21      33           78
6            7   GH      M      32      43      28          103
7            8   HI      F      50      39      24          113
8            9   IJ      M       6      28      38           72
9           10   JK      F      28      25      20           73

In [8]:
min_Marks1 = df['Marks1'].min()
min_Marks1

6

In [9]:
max_Marks2 = df['Marks2'].max()
max_Marks2

44

In [10]:
avg_Marks3 = df['Marks3'].mean()
avg_Marks3

30.2

In [11]:
df2 = df.query('Total_Marks == 114')['Name']
df2

4    EF
Name: Name, dtype: object

In [31]:
df3 = df['Marks2'].lt(40)
df3

0     True
1    False
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
Name: Marks2, dtype: bool

In [32]:
count_df3 = df3[df3 == True]
len(count_df3)

8